In [54]:
import pandas as pd
import numpy as np
from datetime import date

In [8]:
# create series
f = ['FB', '2001-08-02', 90, 3.2]
print(f)
f = pd.Series(f, index = ['name', 'date', 'shares', 'price'])
print(f)

['FB', '2001-08-02', 90, 3.2]
name              FB
date      2001-08-02
shares            90
price            3.2
dtype: object

In [9]:
f[['shares', 'price']]

shares     90
price     3.2
dtype: object

In [24]:
# create dataframe by 
dc = { 'name' : ['AA', 'IBM', 'GOOG'],
    'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],     
    'shares' : [100, 30, 90],
    'price' : [12.3, 10.3, 32.2]}
df = pd.DataFrame(dc)
df

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [25]:
df.columns

Index(['name', 'date', 'shares', 'price'], dtype='object')

In [26]:
# Read columns by loop
for col in df.columns:
    print(col)

name
date
shares
price

In [35]:
# read csv file
df1 = pd.read_csv("bank_additional.csv",delimiter=";")
df1.head(5)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no
2,25,services,married,high.school,no,yes,no,telephone,jun,wed,...,1,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,fri,...,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,...,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no

In [36]:
# dataframe all columns name with datatype
df1.dtypes

age                 int64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp.var.rate      float64
cons.price.idx    float64
cons.conf.idx     float64
euribor3m         float64
nr.employed       float64
y                  object
dtype: object

In [37]:
# full summary of the dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4119 entries, 0 to 4118
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             4119 non-null   int64
 1   job             4119 non-null   object
 2   marital         4119 non-null   object
 3   education       4119 non-null   object
 4   default         4119 non-null   object
 5   housing         4119 non-null   object
 6   loan            4119 non-null   object
 7   contact         4119 non-null   object
 8   month           4119 non-null   object
 9   day_of_week     4119 non-null   object
 10  duration        4119 non-null   int64
 11  campaign        4119 non-null   int64
 12  pdays           4119 non-null   int64
 13  previous        4119 non-null   int64
 14  poutcome        4119 non-null   object
 15  emp.var.rate    4119 non-null   float64
 16  cons.price.idx  4119 non-null   float64
 17  cons.conf.idx   4119 non-null   float64
 18  euribor3m       4119 non-null   float64
 19  nr.employed     4119 non-null   float64
 20  y               4119 non-null   object
dtypes: float64(5), int64(5), object(11)
memory usage: 675.9+ KB

In [38]:
# short summary of the dataframe
df1.info(verbose = False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4119 entries, 0 to 4118
Columns: 21 entries, age to y
dtypes: float64(5), int64(5), object(11)
memory usage: 675.9+ KB

In [39]:
# Print the full summary of the dataframe with null count excluded
df.info(verbose = True, null_counts = False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   name    object
 1   date    object
 2   shares  int64
 3   price   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes

In [41]:
# Inserting a value at the first position in the index. 
idx = pd.Index(['Labrador', 'Beagle', 'Labrador', 
                     'Lhasa', 'Husky', 'Beagle']) 
print(idx)
print(idx.insert(1, 'Great_Dane'))

Index(['Labrador', 'Beagle', 'Labrador', 'Lhasa', 'Husky', 'Beagle'], dtype='object')
Index(['Labrador', 'Great_Dane', 'Beagle', 'Labrador', 'Lhasa', 'Husky',
       'Beagle'],
      dtype='object')

In [42]:
# Inserting a value at the first position in the index from the last
idx.insert(-1, 'Great_Dane')

Index(['Labrador', 'Beagle', 'Labrador', 'Lhasa', 'Husky', 'Great_Dane',
       'Beagle'],
      dtype='object')

In [70]:
# datetime 
df = pd.DataFrame({
    'name':[
        'jh','ma','pe','je','bi'
    ],
    'date_of_birth':[
        '2000-01-01', '1999-12-20', '2000-11-01', '1995-02-25', '1992-06-30',
    ],
})
print(df)
print(df.dtypes)

  name date_of_birth
0   jh    2000-01-01
1   ma    1999-12-20
2   pe    2000-11-01
3   je    1995-02-25
4   bi    1992-06-30
name             object
date_of_birth    object
dtype: object

In [53]:
# convert the column (it's a string) to datetime type
dts = pd.to_datetime(df['date_of_birth'])
print(dts)
print(dts.dtypes)

0   2000-01-01
1   1999-12-20
2   2000-11-01
3   1995-02-25
4   1992-06-30
Name: date_of_birth, dtype: datetime64[ns]
datetime64[ns]

In [55]:
# Create lag columns using shift
df = pd.DataFrame(
    data={'reading': np.random.uniform(high=100,size=10)},
    index=pd.to_datetime([date(2019,1,d) for d in range(1,11)])
)
df

              reading
2019-01-01  96.458754
2019-01-02  29.903069
2019-01-03  56.664855
2019-01-04   6.755946
2019-01-05   2.085183
2019-01-06  30.459767
2019-01-07  81.056255
2019-01-08   2.880082
2019-01-09  39.871806
2019-01-10   9.163954

In [56]:
# D minus 1 = current day minus 1
df['reading_d_minus_1']=df['reading'].shift(1,freq='D')
df

              reading  reading_d_minus_1
2019-01-01  96.458754                NaN
2019-01-02  29.903069          96.458754
2019-01-03  56.664855          29.903069
2019-01-04   6.755946          56.664855
2019-01-05   2.085183           6.755946
2019-01-06  30.459767           2.085183
2019-01-07  81.056255          30.459767
2019-01-08   2.880082          81.056255
2019-01-09  39.871806           2.880082
2019-01-10   9.163954          39.871806

In [57]:
# create columns for 2 days before as well
df['reading_d_minus_2']=df['reading'].shift(2,freq='D')
df

              reading  reading_d_minus_1  reading_d_minus_2
2019-01-01  96.458754                NaN                NaN
2019-01-02  29.903069          96.458754                NaN
2019-01-03  56.664855          29.903069          96.458754
2019-01-04   6.755946          56.664855          29.903069
2019-01-05   2.085183           6.755946          56.664855
2019-01-06  30.459767           2.085183           6.755946
2019-01-07  81.056255          30.459767           2.085183
2019-01-08   2.880082          81.056255          30.459767
2019-01-09  39.871806           2.880082          81.056255
2019-01-10   9.163954          39.871806           2.880082

In [59]:
df1.shape

(4119, 21)

In [61]:
# count of marital
df1["marital"].value_counts()

married     2509
single      1153
divorced     446
unknown       11
Name: marital, dtype: int64

In [64]:
# Make all marital name characters lowercase
df1["marital"].str.lower()

married     2509
single      1153
divorced     446
unknown       11
Name: marital, dtype: int64

In [68]:
# Make all marital name characters uppercase
df1["marital"].str.upper()

0       MARRIED
1        SINGLE
2       MARRIED
3       MARRIED
4       MARRIED
         ...
4114    MARRIED
4115    MARRIED
4116     SINGLE
4117    MARRIED
4118     SINGLE
Name: marital, Length: 4119, dtype: object

In [73]:
# split dataframe columns
df = pd.DataFrame({
    'name':[
        'pr lh','ma km','pe po','je tg','bi ys'
    ], 
    'date_of_birth':[
        '2000-01-01', '1999-12-20', '2000-11-01', '1995-02-25', '1992-06-30',
    ],
})
df

    name date_of_birth
0  pr lh    2000-01-01
1  ma km    1999-12-20
2  pe po    2000-11-01
3  je tg    1995-02-25
4  bi ys    1992-06-30

In [74]:
df["name"].str.split(" ")

0    [pr, lh]
1    [ma, km]
2    [pe, po]
3    [je, tg]
4    [bi, ys]
Name: name, dtype: object

In [76]:
# name length
df["name"].str.len()

0    5
1    5
2    5
3    5
4    5
Name: name, dtype: int64

In [78]:
# generate a sample random row
df.sample(n=2)

    name date_of_birth
4  bi ys    1992-06-30
2  pe po    2000-11-01

In [79]:
# datframe subset
df = pd.DataFrame({'a': np.random.randn(10), 'b': np.random.randn(10)})
df

          a         b
0 -0.039876  1.196499
1  0.297374  0.994623
2 -1.665233  1.157535
3  0.469101  0.024574
4 -1.284852 -1.314194
5 -2.086273  0.296773
6 -1.585161 -2.155455
7 -1.617374  0.386504
8  0.273392 -1.097557
9  1.537789  0.772255

In [80]:
df.query('a <= b')

          a         b
0 -0.039876  1.196499
1  0.297374  0.994623
2 -1.665233  1.157535
5 -2.086273  0.296773
7 -1.617374  0.386504

In [81]:
df[df['a'] <= df['b']]

          a         b
0 -0.039876  1.196499
1  0.297374  0.994623
2 -1.665233  1.157535
5 -2.086273  0.296773
7 -1.617374  0.386504

In [82]:
df.loc[df['a'] <= df['b']]

          a         b
0 -0.039876  1.196499
1  0.297374  0.994623
2 -1.665233  1.157535
5 -2.086273  0.296773
7 -1.617374  0.386504

In [84]:
df.eval('a + b')

0    1.156623
1    1.291997
2   -0.507699
3    0.493675
4   -2.599046
5   -1.789499
6   -3.740616
7   -1.230870
8   -0.824165
9    2.310043
dtype: float64